backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, 80, 1]
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      dtype: float32
      filters: 10
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [20]
      name: conv1d_13
      padding: valid
      strides: !!python/tuple [5]
      trainable: true
      use_bias: true
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 20
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5]
      name: conv1d_14
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
  - class_name: Conv1D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: !!python/tuple [1]
      filters: 40
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5]
      name: conv1d_15
      padding: valid
      strides: !!python/tuple [1]
      trainable: true
      use_bias: true
  - class_name: Flatten
    config: {data_format: channels_last, name: flatten_5, trainable: true}
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_5
      trainable: true
      units: 1
      use_bias: true
  name: sequential_5
keras_version: 2.2.4
